const food = new Map([
  ['不要吃', { cn: '不要吃', canto: '唔好食' }],
  ['吃什麼自己想啦', { cn: '{meal}吃什麼？自己想啦', canto: '{meal}食咩？咁大個人自己諗啦' }],
  ['那個食物吧', { cn: '{meal}就吃那個吧', canto: '{meal}就食嗰樣啦' }],
  ['牛奶卡樂B', { cn: '{meal}就把牛奶和卡樂B倒一起搖來吃', canto: '{meal}就將牛奶同卡樂B撈埋Shake來食' }],
])

const drink = new Map([
  ['不要喝', { cn: '不要喝', canto: '唔好飲' }],
  ['喝什麼自己想啦', { cn: '喝什麼？自己想啦', canto: '飲咩？咁大個人自己諗啦' }],
  ['那個飲料吧', { cn: '就喝那個吧', canto: '就飲嗰樣啦' }],
])

const setMeal = new Map([
  ['不要吃', { cn: '不要吃', canto: '唔好食' }],
  ['不要喝', { cn: '不要喝', canto: '唔好飲' }],
  ['吃什麼自己想啦', { cn: '吃什麼就自己想啦', canto: '食咩就自己諗啦' }],
  ['喝什麼自己想啦', { cn: '而喝什麼就自己想啦', canto: '至於飲咩就自己諗啦' }],
  ['那個食物吧', { cn: '那就吃那個吧', canto: '咁就食嗰樣啦' }],
  ['那個飲料吧', { cn: '飲料的話就那個吧', canto: '野飲既話就嗰樣啦' }],
  ['牛奶卡樂B', { cn: '那就把牛奶和卡樂B倒一起搖來吃', canto: '咁就將牛奶同卡樂B撈埋Shake來食' }],
])

module.exports = {
  food,
  drink,
  setMeal,
}
